
import {ReactComponent as Pusher} from "../../images/content/pusher.svg";
import {ReactComponent as AutoChair} from "../../images/content/auto-chair.svg";
import {ReactComponent as Babybootle} from "../../images/content/baby-bootle.svg";
import {ReactComponent as Bycicle} from "../../images/content/bycicle.svg";
import {ReactComponent as Toys} from "../../images/content/toys.svg";
import {ReactComponent as Clothes} from "../../images/content/clothes.svg";




export const catalogs = [
    {
      icon: <Pusher/>,
      title: 'Коляски',
      subCatalogs: [
        {
        title: 'Куклы и аксессуары',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Игры для дома и дачи',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Машинки, тракторы, самолеты, дороги, роботы',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Детские кухни, магазины, посуды, комплекты врача',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }
    ]
    },
    {
      icon: <AutoChair/>,
      title: 'Автокресла',
      subCatalogs: [ {
        title: 'Погремушки',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Настольные игры',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Игрушки для сна',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Активные игры',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }]
    },
    {
      icon: <Babybootle/>,
      title: 'Детская комната',
      subCatalogs: [ {
        title: 'Куклы и аксессуары',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Игры для дома и дачи',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Машинки, тракторы, самолеты, дороги, роботы',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Детские кухни, магазины, посуды, комплекты врача',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }]
    },
  
    {
      icon: <Bycicle/>,
      title: 'Транспорт и спорт',
      subCatalogs: [ {
        title: 'Карусели на кроватку',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Песочницы',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Конструкторы',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Детские кухни, магазины, посуды, комплекты врача',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }]
    },
    {
      icon: <Toys/>,
      title: 'Игрушки и игры',
      subCatalogs: [ {
        title: 'Куклы и аксессуары',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Игры для дома и дачи',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Машинки, тракторы, самолеты, дороги, роботы',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Детские кухни, магазины, посуды, комплекты врача',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }]
    },
    {
      icon: <Clothes/>,
      title: 'Одежда и обувь',
      subCatalogs: [ {
        title: 'Куклы и аксессуары',
        subCatalogsTitle: ['LOL куклы и аксессуары', 'Babyborn куклы и аксессуаы',
          'Barbie куклы и аксессуаы', 'Мягкие куклы', 'Аксессуары для кукол (Коляски, дома, одежда и т.д)']
      },
      {
        title: 'Игры для дома и дачи',
        subCatalogsTitle: ['Игровые домики', 'Детские палатки',
          'Горки и лазалки', 'Песочницы', 'Батуты', 'Бассейны', 'Детские качели']
      },
  {
        title: 'Машинки, тракторы, самолеты, дороги, роботы',
        subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
          'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
      },
      {
            title: 'Детские кухни, магазины, посуды, комплекты врача',
            subCatalogsTitle: ['Радиоуправляемые игрушки', 'Машинки, самолеты, лодки, модели',
              'Тяжелая техника и тракторы', 'Роботы', 'Поезда и железные дороги', 'Трассы и гаражи']
          }]
    },
  ]